## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,485 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
+ <= read (data resources)
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.flexible-mysql.data.azurerm_client_config.current will be read during apply
+  # (depends on a resource or a module with changes pending)
+ <= data "azurerm_client_config" "current" {
+      + client_id       = (known after apply)
+      + id              = (known after apply)
+      + object_id       = (known after apply)
+      + subscription_id = (known after apply)
+      + tenant_id       = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_key_vault_key.main[0] will be created
+  + resource "azurerm_key_vault_key" "main" {
+      + curve                   = (known after apply)
+      + e                       = (known after apply)
+      + id                      = (known after apply)
+      + key_opts                = [
+          + "encrypt",
+          + "decrypt",
+          + "sign",
+          + "verify",
+          + "wrapKey",
+          + "unwrapKey",
+        ]
+      + key_size                = 2048
+      + key_type                = "RSA"
+      + key_vault_id            = (known after apply)
+      + n                       = (known after apply)
+      + name                    = "cmk-key-core-dev-inci"
+      + public_key_openssh      = (known after apply)
+      + public_key_pem          = (known after apply)
+      + resource_id             = (known after apply)
+      + resource_versionless_id = (known after apply)
+      + version                 = (known after apply)
+      + versionless_id          = (known after apply)
+      + x                       = (known after apply)
+      + y                       = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_monitor_diagnostic_setting.main[0] will be created
+  + resource "azurerm_monitor_diagnostic_setting" "main" {
+      + id                             = (known after apply)
+      + log_analytics_destination_type = "AzureDiagnostics"
+      + log_analytics_workspace_id     = (known after apply)
+      + name                           = "mysql-diag-log-core-dev-inci"
+      + target_resource_id             = (known after apply)
+
+      + enabled_log {
+          + category       = "MySqlAuditLogs"
+            # (1 unchanged attribute hidden)
+        }
+
+      + enabled_metric {
+          + category = "AllMetrics"
+        }
+
+      + metric (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_mysql_flexible_database.main[0] will be created
+  + resource "azurerm_mysql_flexible_database" "main" {
+      + charset             = "utf8mb3"
+      + collation           = "utf8mb3_unicode_ci"
+      + id                  = (known after apply)
+      + name                = "maindb"
+      + resource_group_name = "rg-core-dev-inci"
+      + server_name         = "mysql-fs-core-dev-inci"
+    }
+
+  # module.flexible-mysql.azurerm_mysql_flexible_server.main[0] will be created
+  + resource "azurerm_mysql_flexible_server" "main" {
+      + administrator_login           = "mysqlusername"
+      + administrator_password        = (sensitive value)
+      + administrator_password_wo     = (write-only attribute)
+      + backup_retention_days         = 7
+      + create_mode                   = "Default"
+      + delegated_subnet_id           = (known after apply)
+      + fqdn                          = (known after apply)
+      + geo_redundant_backup_enabled  = false
+      + id                            = (known after apply)
+      + location                      = "centralindia"
+      + name                          = "mysql-fs-core-dev-inci"
+      + private_dns_zone_id           = (known after apply)
+      + public_network_access         = "Disabled"
+      + public_network_access_enabled = (known after apply)
+      + replica_capacity              = (known after apply)
+      + replication_role              = (known after apply)
+      + resource_group_name           = "rg-core-dev-inci"
+      + sku_name                      = "B_Standard_B1ms"
+      + tags                          = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-flexible-mysql"
+        }
+      + version                       = "8.0.21"
+      + zone                          = "1"
+
+      + customer_managed_key {
+          + key_vault_key_id                  = (known after apply)
+          + primary_user_assigned_identity_id = (known after apply)
+        }
+
+      + identity {
+          + identity_ids = (known after apply)
+          + type         = "UserAssigned"
+        }
+
+      + storage {
+          + auto_grow_enabled   = true
+          + io_scaling_enabled  = false
+          + iops                = 360
+          + log_on_disk_enabled = false
+          + size_gb             = 20
+        }
+    }
+
+  # module.flexible-mysql.azurerm_role_assignment.primary_cmk_role_assignment[0] will be created
+  + resource "azurerm_role_assignment" "primary_cmk_role_assignment" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = (known after apply)
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Service Encryption User"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
+  # module.flexible-mysql.azurerm_user_assigned_identity.main[0] will be created
+  + resource "azurerm_user_assigned_identity" "main" {
+      + client_id           = (known after apply)
+      + id                  = (known after apply)
+      + location            = "centralindia"
+      + name                = "cmk-umi-core-dev-inci"
+      + principal_id        = (known after apply)
+      + resource_group_name = "rg-core-dev-inci"
+      + tenant_id           = (known after apply)
+    }
+
+  # module.flexible-mysql.random_password.main[0] will be created
+  + resource "random_password" "main" {
+      + bcrypt_hash = (sensitive value)
+      + id          = (known after apply)
+      + length      = 16
+      + lower       = true
+      + min_lower   = 2
+      + min_numeric = 4
+      + min_special = 0
+      + min_upper   = 4
+      + number      = true
+      + numeric     = true
+      + result      = (sensitive value)
+      + special     = false
+      + upper       = true
+    }
+
+  # module.log-analytics.azurerm_log_analytics_workspace.main[0] will be created
+  + resource "azurerm_log_analytics_workspace" "main" {
+      + allow_resource_only_permissions = true
+      + daily_quota_gb                  = 1
+      + id                              = (known after apply)
+      + internet_ingestion_enabled      = true
+      + internet_query_enabled          = true
+      + local_authentication_disabled   = (known after apply)
+      + local_authentication_enabled    = (known after apply)
+      + location                        = "centralindia"
+      + name                            = "law-core-dev-inci"
+      + primary_shared_key              = (sensitive value)
+      + resource_group_name             = "rg-core-dev-inci"
+      + retention_in_days               = (known after apply)
+      + secondary_shared_key            = (sensitive value)
+      + sku                             = "PerGB2018"
+      + tags                            = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-log-analytics"
+        }
+      + workspace_id                    = (known after apply)
+    }
+
+  # module.private_dns.azurerm_private_dns_zone.this["key_vault"] will be created
+  + resource "azurerm_private_dns_zone" "this" {
+      + id                                                    = (known after apply)
+      + max_number_of_record_sets                             = (known after apply)
+      + max_number_of_virtual_network_links                   = (known after apply)
+      + max_number_of_virtual_network_links_with_registration = (known after apply)
+      + name                                                  = "privatelink.vaultcore.azure.net"
+      + number_of_record_sets                                 = (known after apply)
+      + resource_group_name                                   = "rg-core-dev-inci"
+      + tags                                                  = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "dns"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-private-dns"
+        }
+
+      + soa_record (known after apply)
+    }
+
+  # module.private_dns.azurerm_private_dns_zone.this["mysql_server"] will be created
+  + resource "azurerm_private_dns_zone" "this" {
+   
```
See the full diff from https://github.com/terraform-az-modules/terraform-azurerm-flexible-mysql/actions/runs/19876144193

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azurerm-flexible-mysql/actions/runs/19876144193)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->